#   Замена подстроки
"""
Дана строка. Замените в этой строке все цифры 1 на слово one.

    Формат ввода
Вводится строка.
    Формат вывода
Выведите ответ на задачу.
"""
line = input()
print(line.replace('1', 'one'))
