#   Удаление символа
"""
Дана строка. Удалите из этой строки все символы @.

    Формат ввода
Вводится строка.
    Формат вывода
Выведите ответ на задачу.
"""
line = input()
print(line.replace('@', ''))
